package P1222;

/**
 * 숙제1
 * 	원의 넓이와 둘레를 구할 수 있는 기능을 가진 클래스를 제작하세요.
 * 	필요한 변수와 함수, 생성자는 생각에 따라서 만들어 사용하세요.
 * 
 * 	단, 원의 반지름이 같으면 같은 클래스로 판정 할 수 있도록 equals()를 오버라이드하세요.
 * 
 * 숙제2
 * 	사각형의 면적을 처리할 수 있는 클래스를 제작하세요.
 * 	필요한 변수와 함수, 생성자는 생각에 따라서 만들어 사용하세요.
 * 
 * 숙제3
 * 	학생의 성적을 관리하는 클래스를 작성하세요.
 * 	필요한 정보나 기능은 마음대로 꾸미세요.
 * 	단, 이 클래스를 출력하면 ??? 학생의 성적입니다. "라고 출력되도록 하세요.
 * 
 * 숙제4
 * 	원의 넓이와 둘레를 구할 수 있는 기능을 가진 클래스를 제작하세요.
 * 	필요한 변수와 함수, 생성자는 생각에 따라서 만들어 사용하세요.
 * 
 * 	단, 이 클래스를 출력하면 "넓이가 ???인 원 클래스 입니다."
 * 	라고 출력하도록 하세요.
 * 
 * 숙제5 
 * 	String클래스가 가지고 있는 함수 10개를 조사하고 그것을 사용하는 예제 프로그램을 만들어 보세요.
 * 	즉, 스스로가 문제를 내고 그 문제를 해결하는 프로그램을 만드세요.
 * 
 */
public class HomeWork01 {
	public HomeWork01() {
		
	}

	public static void main(String[] args) {

	}
}
