package Other;

/**
 * 
 */
public class SameTest {
	//2. 같은 폴더(패키지)안에 있는 클래스에는 어디까지 
	//    사용할 수 있을까?
	
	void test(){
		//다른 크래스의 변수를 사용하기 위해서는 new 시켜야 사용 할 수 있다.
		
		MyClass01 my = new MyClass01();
		//public은 모든 다른 클래스에서 사용 할 수 있으므로...
		my.pub = 1000;
		// 상속관계에 있거나 + 같은 패키지 클래스이면 사용 할 수 있으므로...
		my.pro = 2000;
		// 같은 패키지 클래스 소속이면 사용 할 수 있으므로...
		my.pack = 3000;
		// private는 자기자신만 사용할 수 있으며
		// 다른 클래스는 그 클래스의 위치등에 관계없이 절대로 사용할 수 없다.
		//	my.pri = 4000;
	}
	
}
